Repository: samuelschnurr/stock-hub
Catalog: StockHubApp/src/locale/messages.*.xlf
Languages: de

source: Dashboard
de: Übersicht

source: Stocks
de: Aktien

source: Lorem Ipsum
de: Lorem Ipsum in deutsch

source: Loading portfolio failed.
de: Portfolio abrufen fehlgeschlagen.

source: Confirmation required
de: Bestätigung erforderlich

source: Do you want to submit this action?
de: Soll diese Aktion ausgeführt werden?

source: Cancel
de: Abbrechen

source: Submit
de: Bestätigen

source: Loading stocks failed.
de: Aktien abrufen fehlgeschlagen.

source: Name is required.
de: Name ist erforderlich.

source: Name must be between 3 and 50 characters.
de: Der Name muss zwischen 3 und 50 Zeichen lang sein.

source: Amount
de: Menge

source: Amount is required.
de: Menge ist erforderlich.

source: Amount must be between 0.0001 and 9,9999,9999,9999.9999.
de: Die Menge muss zwischen 0.0001 und 9,9999,9999,9999.9999 liegen.

source: Acquisition price per unit
de: Einstandspreis pro Einheit

source: Acquisition price per unit is required.
de: Einstandspreis pro Einheit ist erforderlich.

source: Acquisition price per unit must be between 0.0001 and 9999,9999.9999.
de: Einstandspreis pro Einheit muss zwischen 0.0001 und 9999,9999.9999 liegen.

source: Cancel
de: Abbrechen

source: Submit
de: Bestätigen

source: Stock is created.
de: Aktien wurde erstellt.

source: Creating stock failed.
de: Erstellen der Aktie fehlgeschlagen.

source: Stock is updated.
de: Aktie wurde aktualisiert.

source: Updating stock failed.
de: Aktualisieren der Aktie fehlgeschlagen.

source: <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="currentColor" class="bi bi-plus" viewBox="0 0 16 16" ><path d="M8 4a.5.5 0 0 1 .5.5v3h3a.5.5 0 0 1 0 1h-3v3a.5.5 0 0 1-1 0v-3h-3a.5.5 0 0 1 0-1h3v-3A.5.5 0 0 1 8 4z" /><path d="M8 4a.5.5 0 0 1 .5.5v3h3a.5.5 0 0 1 0 1h-3v3a.5.5 0 0 1-1 0v-3h-3a.5.5 0 0 1 0-1h3v-3A.5.5 0 0 1 8 4z" /></svg> Add new
de: <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="currentColor" class="bi bi-plus" viewBox="0 0 16 16" ><path d="M8 4a.5.5 0 0 1 .5.5v3h3a.5.5 0 0 1 0 1h-3v3a.5.5 0 0 1-1 0v-3h-3a.5.5 0 0 1 0-1h3v-3A.5.5 0 0 1 8 4z" /><path d="M8 4a.5.5 0 0 1 .5.5v3h3a.5.5 0 0 1 0 1h-3v3a.5.5 0 0 1-1 0v-3h-3a.5.5 0 0 1 0-1h3v-3A.5.5 0 0 1 8 4z" /></svg> Anlegen

source: Do you want to delete this stock?
de: Möchten Sie diese Aktie löschen?

source: Stock is deleted.
de: Aktie wurde gelöscht.

source: Deleting stock failed.
de: Löschen der Aktie fehlgeschlagen.
